<template>
**Предварительная инструкция**

Все названия в описании рецепта должны быть на английском языке, а следовательно запускаем игру на английском или пользуемся https://lifeisfeudal.fandom.com/de/wiki/Life_is_Feudal-Wiki для перевода. А так же "блокнот", где мы будем описывать рецепт.

Находим рецепт, который ещё не описан или в котором сделана ошибка, во втором случае указывайте это в сообщении.
В примере мы опишем рецепт "*ступки и пестика*" (https://lifeisfeudal.fandom.com/wiki/Mortar_and_pestle)
 В блокноте записываем категорию навыков, к которому принадлежит этот рецепт, и внешние фигурные скобки. А в этих фигурных скобках в атрибуте "name" английское название предмета:
```
Ремёсла
{
  "name": "Mortar and pestle"
}```

Дальше добавим в описание рецепта второй атрибут "materials" с квадратными скобками, внутри которых мы будем перечислять ингредиенты.
```
Ремёсла
{
  "name": "Mortar and pestle",
  "materials": [
  ]
}```

*Ступка и пестик* делаются из двух ингредиентов *камня* https://lifeisfeudal.fandom.com/wiki/Rock и *ветки* https://lifeisfeudal.fandom.com/wiki/Branch . Добавим их по очереди.
Начнём с *камня*. Нужна 1 штука (*quantity*), влияние на качество 30% (*weight*), и получается:
```
Ремёсла
{
  "name": "Mortar and pestle",
  "materials": [
    {
      "name": "Rock",
      "quantity": 1,
      "weight": 30
    }
  ]
}```
Добавим и *ветку*. Нужна 1 штука (*quantity*), влияние на качество 30% (*weight*):
```
Ремёсла
{
  "name": "Mortar and pestle",
  "materials": [
    {
      "name": "Rock",
      "quantity": 1,
      "weight": 30
    },
    {
      "name": "Branch",
      "quantity": 1,
      "weight": 30
    }
  ]
}```

В качестве второго примера рассмотрим рецепт **Сыра** https://lifeisfeudal.fandom.com/wiki/Cheese , для приготовления которого помимо ингредиентов нужны инструмент и "верстак".
Для обозначения влияния на качество инструмента используем атрибут "toolWeight" (тут 10%), а для обозначения влияния "верстака" добавим другой атрибут "workbenchWeight" (тоже 10%).

И получается:
```
Кулинария
{
  "name": "Cheese",
  "src": "static.wikia.nocookie.net/lifeisfeudal_gamepedia/images/a/a5/Cheese.png",
  "minLevel": 0,
  "materials": [
    {
      "name": "Milk",
      "quantity": 1,
      "weight": 60
    }
  ],
  "toolWeight": 10,
  "workbenchWeight": 10
}
```

P.S. На сайте фандомпедии указан неправильный рецепт (предположительно от ММО), придерживаемся того, что в игре.


</template>
